<?php
return
[
    'denied' => 'ДОСТУП ЗАПРЕЩЁН ДЛЯ НЕАВТОРИЗОВАННОГО ДЕЙСТВИЯ',
    'user_invalid' => 'Имя пользователя и Email не могут быть пустыми',
    'update_ok' => 'Запись успешно обновлена',
    'store_ok' => 'Запись успешно создана',
    'del_ok' => 'Запись успешно удалена',
    'delete_ok' => 'Запись успешно удалена',
    'pu_reset' => 'Пароль пользователя успешно сброшен',
    'p_reset' => 'Пароль успешно сброшен',
    'p_reset_fail' => 'Вы ввели неправильный пароль!',
    'lock_exam' => 'Для просмотра результатов потребуется PIN, если установлен замок экзамена',
    'rnf' => 'Запись не найдена',
    'srnf' => 'Запись студента не найдена',
    'ernf' => 'Запись экзамена не найдена',
    'nstp' => 'Нет студентов для перевода',
    'pin_max' => 'Превышен лимит генерации PIN-кодов (500)',
    'pin_fail' => 'Этот PIN уже использован другим пользователем или превышен лимит использования (5)',
    'pin_create' => 'PIN-коды успешно сгенерированы',
    'del_teacher' => 'Перед удалением этого преподавателя необходимо найти замену по предметам, которые он/она преподаёт. Посмотрите профиль преподавателя, чтобы увидеть предметы',
    'invalid_time_slot' => 'Время начала и окончания не может совпадать',
];

